In [5]:
# Import Libraries
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error
import matplotlib.pyplot as plt
import joblib

# Load Data
file_path = 'player.xlsx'
df = pd.read_excel(file_path)

In [6]:
# Display Data
df.head()

,Rank,Player,Team,RAA,Wins,EFscore,Salary,Value,Year
0,1,SE Marsh,Kings XI Punjab,377,1.355,0.231,NaN,"$1,270,355",2008
1,2,SR Watson,Rajasthan Royals,347,1.250,0.297,"$125,000","$1,209,660",2008
2,3,Sohail Tanvir,Rajasthan Royals,294,1.059,0.194,NaN,"$1,099,252",2008
3,4,G Gambhir,Delhi Daredevils,216,0.776,0.160,"$725,000","$935,664",2008
4,5,GC Smith,Rajasthan Royals,202,0.725,0.139,"$250,000","$906,183",2008

#Data Cleaning

In [ ]:
# Drop irrelevant columns
df = df.drop(['Rank', 'Team'], axis=1)